Revit 2024 API
BuiltInFailures.DimensionFailures.LinearDimensionReferenceNotOrthogonalToView Property
 The planes of one or more references are not exactly orthogonal to this view. The dimension to these reference cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LinearDimensionReferenceNotOrthogonalToView { get; }
Visual Basic
Public Shared ReadOnly Property LinearDimensionReferenceNotOrthogonalToView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LinearDimensionReferenceNotOrthogonalToView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace